Show / Hide Table of Contents
Class ResultClass
ResultClass object
Inheritance
System.Object
OpenObject
OpenElementId
ResultClass
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Loading
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Loading.ResultClass,CI.Loading", "CI.StructModel.Loading.IResultClass,CI.BasicTypes", typeof(ResultClass))]
public class ResultClass : OpenElementId
Constructors
Improve this Doc   View Source
ResultClass()
constructor
Declaration
public ResultClass()
Properties
Improve this Doc   View Source
Description
Description of IResultClass
Declaration
public string Description { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
IdConstructionStage
Id of IConstructionStage, 0 == IConstructionStage is not defined
Declaration
public int IdConstructionStage { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
ListItem
List of objects in this library
Declaration
public List<SelectionItemForResults> ListItem { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<SelectionItemForResults>
Improve this Doc   View Source
Name
Name of ResultClass
Declaration
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Nonlinear
Class contains nonlinear combinations (loaded as loadcase)
Declaration
public bool Nonlinear { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
TypeResultClass
TypeResultsClass
Declaration
public TypeResultsClass TypeResultClass { get; set; }
Property Value
 Type |  Description
 TypeResultsClass
Improve this Doc   View Source
TypeUpdateResultClass
Type of update RC. If TypeUpdateResultClass is Update, ListItem will be updated
Declaration
public TypeUpdateResultClass TypeUpdateResultClass { get; set; }
Property Value
 Type |  Description
 TypeUpdateResultClass
 Improve this Doc
 View Source